# OLDMassDistStrToReal

## Description
Converts distributed mass string to real number and returns TRUE on success.

```pascal
FUNCTION OLDMassDistStrToReal(
				distrMassString : STRING;
				VAR realValue   : REAL): BOOLEAN;
```

```python
def vs.OLDMassDistStrToReal(distrMassString):
    return (BOOLEAN, realValue)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|distrMassString|STRING|   |
|realValue|REAL|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis